In [7]:
import os
import pandas as pd
import plotly.express as px
import streamlit as st
import matplotlib.pyplot as plt

ModuleNotFoundError: No module named 'streamlit'

In [10]:
# 폴더내에 
def read_xlsx_files():
	path = "./data"
	file_list = os.listdir(path)
	lst_xlsx = [file for file in file_list if file.endswith(".xlsx")]
	return lst_xlsx
	


# 데이터 파일 불러오기 및 전처리
def get_excelfile(p_file):
	df = pd.read_excel(
		io = f'./data/{p_file}',
		engine="openpyxl",
		sheet_name="실시간 학생수",
		skiprows=1,
		usecols="A:D",
		nrows=39
	)

	# '반'칼럼 nan값 삭제
	df = df.dropna(axis=0, subset=['반'])

	# 이덱스 리셋
	df = df.reset_index(drop='INDEX')

    # 인원 합계
	df['합계'] = df['남'] + df['여']
	return df

lst_xlsx = read_xlsx_files()

In [9]:
lst_xlsx

['220823.xlsx', '220820.xlsx']

In [19]:
df = get_excelfile('220823.xlsx').ffill()

      남   여   합계
학년
1학년  61  60  121
2학년  55  45  100
3학년  64  54  118
4학년  77  67  144
5학년  72  66  138
6학년  76  61  137

In [37]:
test = df.groupby('학년').sum()

test_t = test.T.reset_index()
test_t.columns = ['성별', '1학년', '2학년', '3학년', '4학년', '5학년', '6학년']
test_t = test_t.drop(index=2)

col_list = list(test_t)
col_list.remove('성별')
test_t['합계'] = test_t[col_list].sum(axis=1)
test_t

  성별  1학년  2학년  3학년  4학년  5학년  6학년   합계
0  남   61   55   64   77   72   76  405
1  여   60   45   54   67   66   61  353

In [39]:
test_t[['성별','합계']]

  성별   합계
0  남  405
1  여  353

In [40]:
test_t

  성별  1학년  2학년  3학년  4학년  5학년  6학년   합계
0  남   61   55   64   77   72   76  405
1  여   60   45   54   67   66   61  353